caseMesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    sides
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    ground
    {
        type            noSlip;
    }
    top
    {
        type            noSlip;
    }
    // giroide_outlet
    // {
    //     type            calculated;
    // }
    // giroide_wall
    // {
    //     type            noSlip;
    // }
    // giroide_inlet
    // {
    //     type            calculated;
    // }
}

// ************************************************************************* //
